Сохранение данных в dev файл для Якупова

In [1]:
import numpy as np
import pandas as pd
import main
las_data = pd.read_csv(main.csv_las_out_full_path, delimiter=';')

In [2]:
wells_list = np.unique(las_data['well_name'].values).tolist()
len(wells_list)

223

Загружаем обводненность

In [3]:
# загружаем wc
water_content_data = pd.read_csv(main.data_dir + "\\water_content.csv", delimiter=';')
water_content_data = water_content_data.rename(columns={'Скважина': main.keys_dict[main.kid_well]})
water_content_data = water_content_data.rename(columns={' Начальная обводненность ': 'wc'})
water_content_data = water_content_data.rename(columns={'Дата запуска': 'date_start'})
water_content_data.head()

  well_name  date_start    wc
0       380  04.07.1905  0.49
1       379  01.12.2006  0.30
2       370  01.02.2007  0.13
3       417  01.03.2007  0.08
4       389  01.08.2007  0.22

In [4]:
las_data = pd.merge(las_data, water_content_data, on=main.keys_dict[main.kid_well])
print(len(np.unique(las_data['well_name'].values).tolist()))
las_data.head()

167

,well_name,STRT,STOP,DEPT,aps,rp,kp,kgl,kpr,kvo,kng,lit,satur,UWI,date_start,wc
0,300,3114.0,3363.6,3114.0,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12
1,300,3114.0,3363.6,3114.1,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12
2,300,3114.0,3363.6,3114.2,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12
3,300,3114.0,3363.6,3114.3,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12
4,300,3114.0,3363.6,3114.4,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12

In [5]:
header_data = pd.read_csv(main.data_dir + "\\Well_Header.csv", delimiter='\t')
header_data.head()
header_data = header_data.rename(columns={'WellName': main.keys_dict[main.kid_well_dop_id]})
del header_data['KB']
del header_data['TopDepth']
del header_data['BottomDepth']
del header_data['Symbol']
del header_data['Rig']
del header_data['Field']
header_data.head()

          UWI    X-Coord     Y-Coord
0  314_103ST2  354719.52  6470051.42
1     314_107  354693.18  6470164.36
2     314_121  354433.25  6468384.38
3   314_125PL  354717.25  6470061.16
4     314_134  354478.44  6468306.61

In [6]:
las_data = pd.merge(las_data, header_data, on='UWI')
print(len(np.unique(las_data['well_name'].values).tolist()))
las_data.head()

167

,well_name,STRT,STOP,DEPT,aps,rp,kp,kgl,kpr,kvo,kng,lit,satur,UWI,date_start,wc,X-Coord,Y-Coord
0,300,3114.0,3363.6,3114.0,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12,353819.66,6464053.68
1,300,3114.0,3363.6,3114.1,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12,353819.66,6464053.68
2,300,3114.0,3363.6,3114.2,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12,353819.66,6464053.68
3,300,3114.0,3363.6,3114.3,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12,353819.66,6464053.68
4,300,3114.0,3363.6,3114.4,0.03,8.2,0.114,0.236,0.1,1.0,0.0,0.0,0.0,314_198,01.11.2012,0.12,353819.66,6464053.68

In [7]:
las_well_info = las_data[['well_name', 'UWI']]
las_well_info = las_well_info.rename(columns={'well_name': 'well_name_fake'})

In [8]:
las_well_info = las_well_info.drop_duplicates()

In [9]:
trace = pd.read_csv(main.data_dir + "\\trace.csv", delimiter=';')
len(np.unique(trace['well_name'].values).tolist())

239

In [10]:
trace = pd.merge(trace, las_well_info, on='UWI')

In [11]:
print(len(np.unique(trace['well_name'].values).tolist()))
trace.head()

167

,UWI,well_name,X,Y,MD,Z,well_name_fake
0,314_100,100,354 727.390,6 470 017.860,10.000,-110.780,312
1,314_100,100,354 727.400,6 470 017.870,20.000,-100.780,312
2,314_100,100,354 727.410,6 470 017.880,30.000,-90.780,312
3,314_100,100,354 727.430,6 470 017.900,40.000,-80.780,312
4,314_100,100,354 727.460,6 470 017.930,50.000,-70.780,312

In [12]:
wells_list = np.unique(trace['well_name'].values).tolist()
path = "C:\\WORK\\ML\\tasks\\task 6\\data\\trace\\"
ext = "dev"
for well in wells_list:    
    well_trace = trace[trace['well_name'] == well]
    main.convert_trace_to_dev(well_trace, path, ext)